carrola1/SpaceCenter/Code/SpaceCenter/SpaceCenter.ioc
#MicroXplorer Configuration settings - do not modify
PB13.GPIOParameters=GPIO_Label
Dma.TIM2_CH4.2.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
PC7.GPIOParameters=GPIO_Label
RCC.USART1Freq_Value=32000000
TSC.ChannelIOs-G6_IO2=TSC_GROUP6_IO2
TSC.ChannelIOs-G6_IO4=TSC_GROUP6_IO4
TSC.ChannelIOs-G6_IO3=TSC_GROUP6_IO3
PE11.GPIOParameters=GPIO_Label
SPI1.VirtualType=VM_MASTER
TSC.SamplingIOs-G8_IO1=TSC_GROUP8_IO1
RCC.PLLCLKFreq_Value=32000000
PB14.GPIO_Label=TOUCH_G6_4_STAR_14
PC6.GPIO_Label=TOUCH_G8_1_SAMP
Dma.TIM2_CH4.2.Priority=DMA_PRIORITY_LOW
RCC.RTCFreq_Value=37000
PA3.GPIOParameters=GPIO_Label
PA6.GPIO_Label=TOUCH_G2_3_STAR_7
PB6.GPIO_Label=TOUCH_G5_3_STAR_22
I2S2.CPOL=I2S_CPOL_HIGH
PC5.Mode=G3_IO1-Sampling
PB13.Signal=TSC_G6_IO3
Dma.SPI1_RX.3.Mode=DMA_NORMAL
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
Dma.SPI2_TX.4.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
TOUCHSENSING.IO_TOUCHKEY18=G2_IO4
Dma.SPI1_TX.5.Instance=DMA1_Channel3
TOUCHSENSING.IO_TOUCHKEY19=G3_IO4
Dma.SPI1_TX.5.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
TOUCHSENSING.IO_TOUCHKEY16=G8_IO3
TOUCHSENSING.IO_TOUCHKEY17=G1_IO4
TOUCHSENSING.IO_TOUCHKEY14=G6_IO3
TOUCHSENSING.IO_TOUCHKEY15=G7_IO3
Dma.SPI2_TX.4.PeriphInc=DMA_PINC_DISABLE
TOUCHSENSING.IO_TOUCHKEY12=G4_IO3
TOUCHSENSING.IO_TOUCHKEY13=G5_IO3
TOUCHSENSING.IO_TOUCHKEY10=G2_IO3
TOUCHSENSING.IO_TOUCHKEY11=G3_IO3
PD15.GPIOParameters=GPIO_Label
PA4.Mode=G2_IO1-Sampling
SPI1.Direction=SPI_DIRECTION_2LINES
Dma.TIM2_CH3.1.Direction=DMA_PERIPH_TO_MEMORY
TIM2.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation3 CH3,Channel-PWM Generation4 CH4,OCFastMode_PWM-PWM Generation1 CH1,OCFastMode_PWM-PWM Generation3 CH3,OCFastMode_PWM-PWM Generation4 CH4,Period
RCC.APB2TimFreq_Value=32000000
PB6.Signal=TSC_G5_IO3
PC7.Signal=TSC_G8_IO2
PB6.Mode=G5_IO3-Channel
SPI1.CalculateBaudRate=4.0 MBits/s
PC3.Signal=TSC_G7_IO4
PD0.Signal=I2S2_WS
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
PE5.Signal=GPIO_Output
PH10.GPIO_Label=TEST_LED
ProjectManager.ProjectBuild=false
PB2.Signal=TSC_G3_IO4
PB3.Mode=G5_IO1-Sampling
PD1.GPIOParameters=GPIO_Speed,GPIO_Label
PD1.GPIO_Label=I2S_SPI2_CK
PB12.GPIO_Label=TOUCH_G6_2_STAR_12
ProjectManager.FirmwarePackage=STM32Cube FW_L0 V1.11.2
MxDb.Version=DB.6.0.20
PB0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Label
Dma.TIM2_CH4.2.Instance=DMA1_Channel4
ProjectManager.BackupPrevious=false
PE9.Signal=S_TIM2_CH1
PD1.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PB14.Mode=G6_IO4-Channel
PB1.GPIO_Label=TOUCH_G3_3_STAR_10
PE4.GPIO_Label=BUTTON_L
PA0.Mode=G1_IO1-Sampling
PC9.Mode=G8_IO4-Channel
TSC.ChannelIOs-G5_IO4=TSC_GROUP5_IO4
TSC.ChannelIOs-G5_IO3=TSC_GROUP5_IO3
TSC.ChannelIOs-G5_IO2=TSC_GROUP5_IO2
I2S2.IPParameters=Instance,VirtualMode,RealAudioFreq,ErrorAudioFreq,AudioFreq,CPOL
Dma.SPI1_RX.3.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PE13.Mode=Full_Duplex_Master
Dma.SPI1_TX.5.Priority=DMA_PRIORITY_LOW
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.HalAssertFull=false
PA0.Signal=TSC_G1_IO1
Dma.TIM2_CH3.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
PC8.GPIOParameters=GPIO_Label
PH10.GPIOParameters=GPIO_Label
Mcu.Package=LQFP100
PB1.Signal=TSC_G3_IO3
PD11.Locked=true
Dma.TIM2_CH3.1.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=TSC_G4_IO2
PE12.GPIO_Label=NEOPIX_ROCKET_R
PA5.GPIOParameters=GPIO_Label
PB14.GPIOParameters=GPIO_Label
Dma.TIM2_CH1.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
TIM2.OCFastMode_PWM-PWM\ Generation4\ CH4=TIM_OCFAST_ENABLE
Dma.SPI1_TX.5.Direction=DMA_MEMORY_TO_PERIPH
RCC.APB1TimFreq_Value=32000000
PB13.Mode=G6_IO3-Channel
SH.S_TIM2_CH4.ConfNb=1
PA4.GPIO_Label=TOUCH_G2_1_SAMP
PD15.Signal=GPIO_Input
ProjectManager.CustomerFirmwarePackage=
TSC.SamplingIOs-G1_IO1=TSC_GROUP1_IO1
RCC.HSI48_VALUE=48000000
RCC.LPTIMFreq_Value=32000000
PA5.Mode=G2_IO2-Channel
RCC.TIMFreq_Value=32000000
PA6.GPIOParameters=GPIO_Label
I2S2.AudioFreq=I2S_AUDIOFREQ_44K
ProjectManager.ProjectFileName=SpaceCenter.ioc
Dma.SPI1_TX.5.MemDataAlignment=DMA_MDATAALIGN_BYTE
RCC.48USBFreq_Value=32000000
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=57
Dma.SPI2_TX.4.Direction=DMA_MEMORY_TO_PERIPH
PC13.Locked=true
Dma.SPI2_TX.4.Priority=DMA_PRIORITY_LOW
RCC.LPUARTFreq_Value=32000000
PC13.Signal=GPIO_Input
PA9.GPIO_Label=TOUCH_G4_1_SAMP
PC2.Signal=TSC_G7_IO3
PC6.Signal=TSC_G8_IO1
PB11.GPIO_Label=TOUCH_G6_1_SAMP
PD1.Signal=I2S2_CK
PA11.GPIO_Label=TOUCH_G4_3_STAR_19
PC0.Signal=TSC_G7_IO1
PC14-OSC32_IN.Signal=GPIO_Output
TSC.SamplingIOs-G6_IO1=TSC_GROUP6_IO1
PD0.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
RCC.WatchDogFreq_Value=37000
PC3.GPIOParameters=GPIO_Label
PD10.Signal=GPIO_Output
PA3.Mode=G1_IO4-Channel
RCC.HSI16_VALUE=16000000
PA15.Locked=true
PB11.Mode=G6_IO1-Sampling
Dma.TIM2_CH4.2.Mode=DMA_CIRCULAR
Mcu.Pin51=PB4
Mcu.Pin52=PB6
Mcu.Pin50=PB3
PC6.Mode=G8_IO1-Sampling
Mcu.Pin55=VP_TIM2_VS_ClockSourceINT
Dma.TIM2_CH4.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Mcu.Pin56=VP_TOUCHSENSING_VS_TOUCHSENSING
Mcu.Pin53=PB7
PE8.GPIO_Label=SD_DET_B
Mcu.Pin54=VP_SYS_VS_Systick
PA9.Signal=TSC_G4_IO1
I2S2.VirtualMode=I2S_MODE_MASTER
Dma.TIM2_CH3.1.MemInc=DMA_MINC_ENABLE
PB11.GPIOParameters=GPIO_Label
Dma.SPI1_TX.5.Mode=DMA_NORMAL
PE9.GPIO_Label=NEOPIX_STARS
Mcu.Pin48=PD0
TSC.ChannelIOs-G7_IO3=TSC_GROUP7_IO3
Mcu.Pin49=PD1
TSC.ChannelIOs-G7_IO2=TSC_GROUP7_IO2
Mcu.Pin46=PA14
Mcu.Pin47=PA15
Dma.SPI1_RX.3.MemInc=DMA_MINC_ENABLE
PB14.Signal=TSC_G6_IO4
PA5.Signal=TSC_G2_IO2
Mcu.Pin40=PC9
Mcu.Pin41=PA9
PE13.GPIOParameters=GPIO_Label
TOUCHSENSING.TSLPRM_TOTAL_TOUCHKEYS=24
Mcu.Pin44=PA12
RCC.MCOPinFreq_Value=32000000
Mcu.Pin45=PA13
Mcu.Pin42=PA10
Mcu.Pin43=PA11
TSC.ChannelIOs-G7_IO4=TSC_GROUP7_IO4
ProjectManager.LastFirmware=true
PD1.Mode=Half_Duplex_Master
Dma.SPI2_TX.4.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
TSC.SamplingIOs-G7_IO1=TSC_GROUP7_IO1
PA1.Mode=G1_IO2-Channel
PE14.Signal=SPI1_MISO
PE15.Signal=SPI1_MOSI
Mcu.Pin37=PC6
PB4.GPIO_Label=TOUCH_G5_2_STAR_21
Mcu.Pin38=PC7
Mcu.Pin35=PD11
PB15.GPIO_Label=I2S_SPI2_SD
RCC.I2C1Freq_Value=32000000
PE8.Signal=GPIO_Input
Mcu.Pin36=PD15
SPI1.Mode=SPI_MODE_MASTER
Dma.SPI2_TX.4.MemDataAlignment=DMA_MDATAALIGN_BYTE
Mcu.Pin39=PC8
PC2.GPIOParameters=GPIO_Label
TOUCHSENSING.TSLPRM_SENSORS_DATAS=TSLPRM_TOTAL_TOUCHKEYS 3 8 8 8 
Mcu.Pin30=PB12
PA1.GPIO_Label=TOUCH_G1_2_STAR_3
Mcu.Pin33=PB15
Mcu.Pin34=PD10
Mcu.Pin31=PB13
Mcu.Pin32=PB14
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SH.S_TIM2_CH3.ConfNb=1
VP_TOUCHSENSING_VS_TOUCHSENSING.Signal=TOUCHSENSING_VS_TOUCHSENSING
TIM2.Period=39
PE7.Locked=true
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
PC9.GPIOParameters=GPIO_Label
Mcu.Pin26=PE13
Mcu.Pin27=PE14
RCC.RTCHSEDivFreq_Value=4000000
Mcu.Pin24=PE11
Dma.TIM2_CH4.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
ProjectManager.UnderRoot=true
Mcu.Pin25=PE12
Mcu.Pin28=PE15
PC7.GPIO_Label=TOUCH_G8_2_STAR_15
Mcu.Pin29=PB11
PC8.Mode=G8_IO3-Channel
PA4.Signal=TSC_G2_IO1
Mcu.Pin22=PE8
Mcu.Pin23=PE9
Mcu.Pin20=PB2
Mcu.Pin21=PE7
PE13.GPIO_Label=SD_SPI1_SCK
PD10.Locked=true
PA5.GPIO_Label=TOUCH_G2_2_STAR_6
NVIC.ForceEnableDMAVector=true
PD11.Signal=GPIO_Output
PE5.GPIO_Label=BUTTON_LED_L
Dma.SPI1_TX.5.PeriphInc=DMA_PINC_DISABLE
ProjectManager.CompilerOptimize=6
PD15.Locked=true
PA11.Signal=TSC_G4_IO3
Dma.TIM2_CH1.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PA6
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PA7
PB1.Mode=G3_IO3-Channel
Mcu.Pin13=PA4
Mcu.Pin14=PA5
Mcu.Pin19=PB1
PD11.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
TOUCHSENSING.IPParameters=TSLPRM_TOTAL_TOUCHKEYS,IO_TOUCHKEY1,IO_TOUCHKEY2,IO_TOUCHKEY3,IO_TOUCHKEY4,IO_TOUCHKEY5,IO_TOUCHKEY6,IO_TOUCHKEY7,IO_TOUCHKEY8,IO_TOUCHKEY9,IO_TOUCHKEY10,IO_TOUCHKEY11,IO_TOUCHKEY12,IO_TOUCHKEY13,IO_TOUCHKEY14,IO_TOUCHKEY15,IO_TOUCHKEY16,IO_TOUCHKEY17,IO_TOUCHKEY18,IO_TOUCHKEY19,IO_TOUCHKEY20,IO_TOUCHKEY21,IO_TOUCHKEY22,IO_TOUCHKEY23,IO_TOUCHKEY24,TSLPRM_SENSORS_DATAS,IO_TOUCHKEY1-TouchSensing_Enabled
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PC5
Mcu.Pin18=PB0
Mcu.Pin11=PA2
Mcu.Pin12=PA3
PD0.GPIOParameters=GPIO_Speed,GPIO_Label
Dma.SPI1_TX.5.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Mcu.Pin10=PA1
NVIC.DMA1_Channel2_3_IRQn=true\:0\:0\:false\:false\:true\:false\:true
TSC.ChannelIOs-G8_IO2=TSC_GROUP8_IO2
PC3.GPIO_Label=TOUCH_G7_4_STAR_2
RCC.PWRFreq_Value=32000000
PE12.GPIOParameters=GPIO_Label
NVIC.DMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true
TSC.ChannelIOs-G8_IO4=TSC_GROUP8_IO4
TSC.ChannelIOs-G8_IO3=TSC_GROUP8_IO3
PB0.Signal=TSC_G3_IO2
Dma.TIM2_CH1.0.PeriphInc=DMA_PINC_DISABLE
PA7.GPIOParameters=GPIO_Label
PC0.Locked=true
PC1.Signal=TSC_G7_IO2
PB12.GPIOParameters=GPIO_Label
PC1.Mode=G7_IO2-Channel
PE15.Mode=Full_Duplex_Master
Mcu.Family=STM32L0
Dma.SPI2_TX.4.MemInc=DMA_MINC_ENABLE
PC3.Mode=G7_IO4-Channel
ProjectManager.MainLocation=Core/Src
Dma.TIM2_CH1.0.MemInc=DMA_MINC_ENABLE
TOUCHSENSING.IO_TOUCHKEY9=G1_IO3
PA6.Mode=G2_IO3-Channel
TOUCHSENSING.IO_TOUCHKEY7=G7_IO2
TOUCHSENSING.IO_TOUCHKEY8=G8_IO2
TIM2.OCFastMode_PWM-PWM\ Generation1\ CH1=TIM_OCFAST_ENABLE
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L072VBTx
PH10.Signal=GPIO_Output
Dma.SPI1_RX.3.PeriphInc=DMA_PINC_DISABLE
PE11.GPIO_Label=NEOPIX_ROCKET_L
PA0.GPIO_Label=TOUCH_G1_1_SAMP
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_I2S2_Init-I2S2-false-HAL-true,5-MX_SPI1_Init-SPI1-false-HAL-true,6-MX_TSC_Init-TSC-false-HAL-true,7-MX_TOUCHSENSING_Init-TOUCHSENSING-false-HAL-false,8-MX_TIM2_Init-TIM2-false-HAL-true
PC0.GPIOParameters=GPIO_Label
PA9.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
Dma.SPI1_RX.3.Instance=DMA1_Channel2
PC0.GPIO_Label=TOUCH_G7_1_SAMP
PD0.GPIO_Label=I2S_SPI2_WS
PA11.Mode=G4_IO3-Channel
PH10.Locked=true
PB0.GPIO_Label=TOUCH_G3_2_STAR_9
Dma.TIM2_CH1.0.Instance=DMA1_Channel5
RCC.USART2Freq_Value=32000000
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
TSC.ChannelIOs-G2_IO2=TSC_GROUP2_IO2
TSC.ChannelIOs-G2_IO3=TSC_GROUP2_IO3
Dma.SPI2_TX.4.Mode=DMA_NORMAL
TSC.ChannelIOs-G2_IO4=TSC_GROUP2_IO4
PC13.GPIO_Label=BUTTON_R
PB13.GPIO_Label=TOUCH_G6_3_STAR_13
PB11.Signal=TSC_G6_IO1
Dma.TIM2_CH3.1.Instance=DMA1_Channel1
PB15.Signal=I2S2_SD
RCC.48CLKFreq_Value=32000000
PE5.GPIOParameters=GPIO_Label
ProjectManager.StackSize=0x400
Dma.SPI1_RX.3.MemDataAlignment=DMA_MDATAALIGN_BYTE
RCC.I2C3Freq_Value=32000000
Mcu.IP4=SPI1
RCC.FCLKCortexFreq_Value=32000000
Mcu.IP5=SYS
Mcu.IP2=NVIC
Mcu.IP3=RCC
PA15.GPIO_Label=SD_SPI1_CS_N
PB4.GPIOParameters=GPIO_Label
Mcu.IP0=DMA
Dma.SPI1_RX.3.Priority=DMA_PRIORITY_LOW
Mcu.IP1=I2S2
PA12.Signal=TSC_G4_IO4
PE4.GPIOParameters=GPIO_Label
Mcu.UserConstants=
TSC.SamplingIOs-G4_IO1=TSC_GROUP4_IO1
PC1.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
Dma.TIM2_CH4.2.PeriphInc=DMA_PINC_DISABLE
PD11.GPIO_Label=AUDIO_SD_N_R
RCC.HCLKFreq_Value=32000000
Mcu.IPNb=9
ProjectManager.PreviousToolchain=
Mcu.Pin6=PC1
Mcu.Pin7=PC2
Mcu.Pin8=PC3
Mcu.Pin9=PA0
RCC.AHBFreq_Value=32000000
Mcu.Pin0=PE4
Mcu.Pin1=PE5
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC13
Mcu.Pin3=PC14-OSC32_IN
Mcu.Pin4=PH10
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PC0
RCC.HSE_VALUE=8000000
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.PLLMUL=RCC_PLLMUL_4
PB4.Mode=G5_IO2-Channel
PE13.Signal=SPI1_SCK
Dma.TIM2_CH4.2.MemInc=DMA_MINC_ENABLE
PA14.Mode=Serial_Wire
PE8.Locked=true
Dma.TIM2_CH1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
Dma.SPI1_RX.3.Direction=DMA_PERIPH_TO_MEMORY
File.Version=6
PA10.GPIO_Label=TOUCH_G4_2_STAR_18
PB3.GPIOParameters=GPIO_Label
Dma.TIM2_CH4.2.Direction=DMA_PERIPH_TO_MEMORY
PB7.Signal=TSC_G5_IO4
SH.S_TIM2_CH1.ConfNb=1
TSC.SamplingIOs-G5_IO1=TSC_GROUP5_IO1
TIM2.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
PE4.Signal=GPIO_Input
Dma.RequestsNb=6
PB6.GPIOParameters=GPIO_Label
PC14-OSC32_IN.GPIOParameters=GPIO_Label
ProjectManager.ProjectName=SpaceCenter
PB7.GPIO_Label=TOUCH_G5_4_STAR_23
Dma.TIM2_CH3.1.Priority=DMA_PRIORITY_LOW
PA6.Signal=TSC_G2_IO3
PB12.Mode=G6_IO2-Channel
TSC.ChannelIOs-G1_IO4=TSC_GROUP1_IO4
TSC.ChannelIOs-G1_IO2=TSC_GROUP1_IO2
TSC.ChannelIOs-G1_IO3=TSC_GROUP1_IO3
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=TOUCH_G1_3_STAR_4
RCC.LSI_VALUE=37000
PA15.Signal=GPIO_Output
Dma.Request2=TIM2_CH4
Dma.Request1=TIM2_CH3
Dma.Request4=SPI2_TX
Dma.Request3=SPI1_RX
Dma.Request5=SPI1_TX
PC14-OSC32_IN.GPIO_Label=BUTTON_LED_R
PC5.Signal=TSC_G3_IO1
PE7.Signal=GPIO_Input
Dma.Request0=TIM2_CH1
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_8
TOUCHSENSING.IO_TOUCHKEY1=G1_IO2
TOUCHSENSING.IO_TOUCHKEY2=G2_IO2
PC2.GPIO_Label=TOUCH_G7_3_STAR_1
Dma.TIM2_CH1.0.Direction=DMA_PERIPH_TO_MEMORY
TOUCHSENSING.IO_TOUCHKEY5=G5_IO2
TOUCHSENSING.IO_TOUCHKEY6=G6_IO2
PC14-OSC32_IN.Locked=true
TOUCHSENSING.IO_TOUCHKEY3=G3_IO2
TOUCHSENSING.IO_TOUCHKEY4=G4_IO2
PB4.Signal=TSC_G5_IO2
PA3.Signal=TSC_G1_IO4
PB3.GPIO_Label=TOUCH_G4_1_SAMP
Dma.SPI1_TX.5.MemInc=DMA_MINC_ENABLE
RCC.MSI_VALUE=2097000
PE8.GPIOParameters=GPIO_Label
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
TOUCHSENSING.IO_TOUCHKEY1-TouchSensing_Enabled=G1_IO2
SH.S_TIM2_CH1.0=TIM2_CH1,PWM Generation1 CH1
PD15.GPIO_Label=MODE_SW
PA7.Mode=G2_IO4-Channel
I2S2.Instance=SPI$Index
PE14.GPIOParameters=GPIO_Label
PA10.Mode=G4_IO2-Channel
PC9.GPIO_Label=TOUCH_G8_4_STAR_17
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
PC8.Signal=TSC_G8_IO3
TSC.ChannelIOs-G4_IO4=TSC_GROUP4_IO4
TSC.ChannelIOs-G4_IO3=TSC_GROUP4_IO3
ProjectManager.DefaultFWLocation=true
PC2.Mode=G7_IO3-Channel
PE14.GPIO_Label=SD_SPI1_MISO
TSC.ChannelIOs-G4_IO2=TSC_GROUP4_IO2
ProjectManager.DeletePrevious=true
RCC.TimerFreq_Value=32000000
PA12.GPIO_Label=TOUCH_G4_4_STAR_20
RCC.FamilyName=M
PC0.Mode=G7_IO1-Sampling
PE9.GPIOParameters=GPIO_Label
PE15.GPIOParameters=GPIO_Label
PC8.GPIO_Label=TOUCH_G8_3_STAR_16
PA13.Signal=SYS_SWDIO
TSC.SamplingIOs-G2_IO1=TSC_GROUP2_IO1
Dma.TIM2_CH3.1.Mode=DMA_CIRCULAR
PA9.Mode=G4_IO1-Sampling
PE15.GPIO_Label=SD_SPI1_MOSI
Dma.SPI2_TX.4.Instance=DMA1_Channel7
ProjectManager.TargetToolchain=STM32CubeIDE
PE7.GPIOParameters=GPIO_Label
PB7.GPIOParameters=GPIO_Label
PC5.GPIOParameters=GPIO_Label
PB2.GPIOParameters=GPIO_Label
PE4.Locked=true
ProjectManager.RegisterCallBack=
TIM2.OCFastMode_PWM-PWM\ Generation3\ CH3=TIM_OCFAST_ENABLE
PD10.GPIO_Label=AUDIO_SD_N_L
PE11.Signal=S_TIM2_CH3
RCC.LSE_VALUE=32768
PA1.Signal=TSC_G1_IO2
VP_TOUCHSENSING_VS_TOUCHSENSING.Mode=TouchSensing_Enabled
PB0.Mode=G3_IO2-Channel
board=custom
RCC.VCOOutputFreq_Value=64000000
PB15.Mode=Half_Duplex_Master
PD11.GPIOParameters=GPIO_Label,GPIO_ModeDefaultOutputPP
RCC.APB2Freq_Value=32000000
Dma.TIM2_CH1.0.Priority=DMA_PRIORITY_LOW
MxCube.Version=6.2.0
NVIC.DMA1_Channel4_5_6_7_IRQn=true\:0\:0\:false\:false\:true\:false\:true
VP_TIM2_VS_ClockSourceINT.Mode=Internal
SH.S_TIM2_CH3.0=TIM2_CH3,PWM Generation3 CH3
PC13.GPIOParameters=GPIO_Label
PE14.Mode=Full_Duplex_Master
PB15.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PC1.GPIO_Label=TOUCH_G7_2_STAR_0
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
TIM2.Channel-PWM\ Generation3\ CH3=TIM_CHANNEL_3
TSC.IPParameters=SamplingIOs-G1_IO1,SamplingIOs-G4_IO1,ChannelIOs-G4_IO2,ChannelIOs-G4_IO3,ChannelIOs-G4_IO4,SamplingIOs-G5_IO1,ChannelIOs-G5_IO2,ChannelIOs-G5_IO3,ChannelIOs-G5_IO4,SamplingIOs-G6_IO1,ChannelIOs-G6_IO2,ChannelIOs-G6_IO3,ChannelIOs-G6_IO4,SamplingIOs-G7_IO1,ChannelIOs-G7_IO2,ChannelIOs-G7_IO3,ChannelIOs-G7_IO4,SamplingIOs-G8_IO1,ChannelIOs-G8_IO2,ChannelIOs-G8_IO3,ChannelIOs-G8_IO4,ChannelIOs-G1_IO2,ChannelIOs-G1_IO3,ChannelIOs-G1_IO4,ChannelIOs-G2_IO2,SamplingIOs-G2_IO1,ChannelIOs-G2_IO3,ChannelIOs-G2_IO4,SamplingIOs-G3_IO1,ChannelIOs-G3_IO2,ChannelIOs-G3_IO3,ChannelIOs-G3_IO4
PA4.GPIOParameters=GPIO_Label
PE5.Locked=true
TOUCHSENSING.IO_TOUCHKEY23=G7_IO4
TOUCHSENSING.IO_TOUCHKEY24=G8_IO4
TOUCHSENSING.IO_TOUCHKEY21=G5_IO4
PB15.GPIOParameters=GPIO_Speed,GPIO_Label
TOUCHSENSING.IO_TOUCHKEY22=G6_IO4
RCC.IPParameters=48CLKFreq_Value,48RNGFreq_Value,48USBFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI16_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C3Freq_Value,LPTIMFreq_Value,LPUARTFreq_Value,LSE_VALUE,LSI_VALUE,MCOPinFreq_Value,MSI_VALUE,PLLCLKFreq_Value,PLLMUL,PWRFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIMFreq_Value,TimerFreq_Value,USART1Freq_Value,USART2Freq_Value,VCOOutputFreq_Value,WatchDogFreq_Value
TOUCHSENSING.IO_TOUCHKEY20=G4_IO4
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L072V(B-Z)Tx
Dma.TIM2_CH3.1.PeriphInc=DMA_PINC_DISABLE
PE7.GPIO_Label=SD_DET_A
PD0.Mode=Half_Duplex_Master
PE12.Signal=S_TIM2_CH4
PA2.Signal=TSC_G1_IO3
Mcu.IP8=TSC
Mcu.IP6=TIM2
Mcu.IP7=TOUCHSENSING
ProjectManager.CoupleFile=false
PB3.Signal=TSC_G5_IO1
RCC.SYSCLKFreq_VALUE=32000000
TSC.ChannelIOs-G3_IO4=TSC_GROUP3_IO4
Dma.TIM2_CH1.0.Mode=DMA_CIRCULAR
TSC.ChannelIOs-G3_IO2=TSC_GROUP3_IO2
TSC.ChannelIOs-G3_IO3=TSC_GROUP3_IO3
PA7.GPIO_Label=TOUCH_G2_4_STAR_8
PA12.Mode=G4_IO4-Channel
I2S2.ErrorAudioFreq=-1.18 %
KeepUserPlacement=false
Dma.TIM2_CH3.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PC5.GPIO_Label=TOUCH_G3_1_SAMP
Dma.SPI1_RX.3.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
TSC.SamplingIOs-G3_IO1=TSC_GROUP3_IO1
PB2.Mode=G3_IO4-Channel
PB7.Mode=G5_IO4-Channel
PA14.Signal=SYS_SWCLK
PB2.GPIO_Label=TOUCH_G3_4_STAR_11
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
PC6.GPIOParameters=GPIO_Label
RCC.HSI_VALUE=16000000
PA2.Mode=G1_IO3-Channel
RCC.48RNGFreq_Value=32000000
PC9.Signal=TSC_G8_IO4
PC7.Mode=G8_IO2-Channel
RCC.APB1Freq_Value=32000000
I2S2.RealAudioFreq=43.478 KHz
ProjectManager.DeviceId=STM32L072VBTx
PB12.Signal=TSC_G6_IO2
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=TOUCH_G1_4_STAR_5
PB1.GPIOParameters=GPIO_Label
PA7.Signal=TSC_G2_IO4
isbadioc=false
